Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: When the argument to @code{upcase} is a string, the function creates and returns a new string in which each letter in the argument that is lower case is converted to upper case.
fr_fr: Quand l'argument pour @code{upcase} est une chaîne, la fonction crée et retourne une nouvelle chaîne dans laquelle chaque lettre de l'argument qui est en minuscule est convertie en majuscule.

source: When the strings have different lengths, and they match up to the length of @var{string1}, then the result is @code{t}. If they match up to the length of @var{string2}, the result is @code{nil}. A string of no characters is less than any other string.
fr_fr: Quand les chaînes sont de longueurs différentes, et qu'elles correspondent à la longueur de @var{string1}, alors le résultat est @code{t}. Si elles correspondent à la longueur de @var{string2}, le résultat est @code{nil}. Une chaîne sans aucun caractère est moindre que toute autre chaîne.

source: When you add an association to a hash table and the table is ``full,'' it grows automatically. This value specifies how to make the hash table larger, at that time.
fr_fr: Quand on ajoute une association à une table de hachage et que la table est ``pleine'', elle s'agrandit automatiquement. Cette valeur spécifie comment agrandir la table de hachage à ce moment-là.

source: When you construct a case table, you can provide @code{nil} for @var{canonicalize}; then Emacs fills in this slot from the lower case and upper case mappings. You can also provide @code{nil} for @var{equivalences}; then Emacs fills in this slot from @var{canonicalize}. In a case table that is actually in use, those components are non-@code{nil}. Do not try to specify @var{equivalences} without also specifying @var{canonicalize}.
fr_fr: Quand on construit une table de casse, on peut mettre @code{nil} pour @var{canonicalize}; dans ce cas Emacs remplit cet emplacement avec les mappages minuscule et majuscule. On peut mettre @code{nil} également pour @var{equivalences}; alors Emacs remplit cet emplacement avec @var{canonicalize}. Dans une table de casse qui se trouve être en cours d' utilisation, ces composant sont non @code{nil}. N'essayez pas de préciser @var{equivalences} sans préciser également @var{canonicalize}.

source: When you create an array, other than a char-table, you must specify its length. You cannot specify the length of a char-table, because that is determined by the range of character codes.
fr_fr: Quand on crée un tableau, qui n'est pas un char-table, on doit obligatoirement spécifier sa longueur. On ne peut pas spécifier la longueur d'un char-table car elle est déterminée par la plage des codes de caractères.

source: Which Emacs version is running?
fr_fr: Quelle version d'Emacs fonctionne?

source: Writing and using documentation strings.
fr_fr: Écriture et utiliser des chaînes de documentation.

source: Writing customization declarations.
fr_fr: Écriture de déclarations de personnalisation.

source: You can customize case conversion by installing a special @dfn{case table}. A case table specifies the mapping between upper case and lower case letters. It affects both the case conversion functions for Lisp objects (see the previous section) and those that apply to text in the buffer (@pxref{Case Changes}). Each buffer has a case table; there is also a standard case table which is used to initialize the case table of new buffers.
fr_fr: On peut personnaliser la conversion de casse en installant une @dfn{table de casse} spécial. Une table de casse spécifie le mappage entre les majuscules et les minuscules. Elle agit à la fois sur les fonctions de conversion de casse pour les objets Lisp (voir la section précédente) et celles qui s'appliquent au texte dans les mémoires tampons (@pxref{Case Changes}). Chaque mémoire tampon a une table de casse; il y a aussi une table de casse standard qui est utilisée pour initialiser la table de casse des nouvelles mémoires tampons.

source: You can define new methods of key lookup by means of @code{define-hash-table-test}. In order to use this feature, you need to understand how hash tables work, and what a @dfn{hash code} means.
fr_fr: On peut définir de nouvelles méthodes de recherche de clé grâce à la fonction @code{define-hash-table-test}. Pour utiliser cette fonctionnalité, il faut comprendre comment les tables de hachages fonctionnent et ce qu'est un @dfn{code de hachage}.

source: You can read this as ``@code{(car '(1 2))} evaluates to 1.''
fr_fr: Vous pouvez lire ceci en tant que « @code{(car '(1 2))} est évalué à 1. »

source: You can test whether an arbitrary Lisp object is a symbol with @code{symbolp}:
fr_fr: Vous pouvez tester si n'importe quel objet Lisp est un symbole avec @code{symbolp} :

source: You can think of a hash table conceptually as a large array of many slots, each capable of holding one association. To look up a key, @code{gethash} first computes an integer, the hash code, from the key. It reduces this integer modulo the length of the array, to produce an index in the array. Then it looks in that slot, and if necessary in other nearby slots, to see if it has found the key being sought.
fr_fr: On peut concevoir une table de hachage comme étant un grand tableau composé de beaucoup de cases, chacune capable de contenir une association. Pour rechercher une clé, @code{gethash} calcule d'abord un entier, le code de hachage, à partir de la clé. Il réduit l'entier modulo la longueur du tableau pour produire un indice du tableau. Ensuite, il regarde dans cette case et si nécessaire dans d'autres cases voisines pour voir s'il trouve la clé qu'il recherche.

source: You can use @code{define-hash-table-test} (@pxref{Defining Hash}) to define additional possibilities for @var{test}.
fr_fr: On peut utiliser @code{define-hash-table-test} (@pxref{Defining Hash}) pour définir des possibilités supplémentaires pour la fonction @var{test}.

source: You can use @code{logb} to extract the binary exponent of a floating point number (or estimate the logarithm of an integer):
fr_fr: Vous pouvez employer @code{logb} pour extraire l'exposant binaire d'un nombre à virgule flottante (ou estimer le logarithme d'un nombre entier):

source: _____________________________________________ | | | Sequence | | ______ ________________________________ | | | | | | | | | List | | Array | | | | | | ________ ________ | | | |______| | | | | | | | | | | Vector | | String | | | | | |________| |________| | | | | ____________ _____________ | | | | | | | | | | | | | Char-table | | Bool-vector | | | | | |____________| |_____________| | | | |________________________________| | |_____________________________________________|
fr_fr: _____________________________________________ | | | Suite | | ______ ________________________________ | | | | | | | | |Liste | | Tableau | | | | | | ________ __________ | | | |______| | | | | Chaîne | | | | | |Vecteur | | de | | | | | | | |caractères| | | | | |________| |__________| | | | | ____________ _____________ | | | | | Table de | | Vecteur | | | | | | chaînes de | | Booléen | | | | | | caractères | | | | | | | |____________| |_____________| | | | |________________________________| | |_____________________________________________|

source: always equals @var{dividend}, subject to rounding error if either argument is floating point. For @code{floor}, see @ref{Numeric Conversions}.
fr_fr: est toujours égale à @var{dividend}, sauf si l'un ou l'autre argument est un nombre à virgule flottante, une erreur sera générée. Pour @code{floor}, voir les @ref{Conversions numériques}.

source: always equals @var{dividend}.
fr_fr: est toujours égale à @var{dividend}.

source: and
fr_fr: et

source: and how you can call its subroutines.
fr_fr: et comment vous pouvez appeler ses sous-programmes.

source: and property lists.
fr_fr: et des listes de propriétés.

source: aset array index object
fr_fr: aset array n object

source: boolean
fr_fr: booléen

source: bugs
fr_fr: erreurs

source: bugs in this manual
fr_fr: erreurs dans ce manuel

source: but some machines may provide a wider range. Many examples in this chapter assume an integer has 29 bits.
fr_fr: mais quelques machines peuvent définir un autre champ. Beaucoup d'exemples en ce chapitre supposent qu'un nombre entier a 29 bits.

source: bytes
fr_fr: Octets

source: capitalization
fr_fr: capitalisation

source: case conversion in Lisp
fr_fr: Conversion de la casse en Lisp

source: char-or-string-p object
fr_fr: char-or-string-p objet

source: char-syntax character
fr_fr: char-syntax caractère

source: character arrays
fr_fr: Tableaux de caractères

source: character case
fr_fr: La casse du caractère

source: character to string
fr_fr: De caractère à chaîne

source: characters
fr_fr: Caractères

source: color
fr_fr: couleur

source: concatenating strings
fr_fr: Concaténation des chaînes

source: conditional evaluation
fr_fr: évaluation d'une condition

source: conversion of strings
fr_fr: Conversion des chaînes

source: convert-standard-filename filename
fr_fr: convert-standard-filename fichier

source: copying strings
fr_fr: Copie des chaînes

source: creating hash tables
fr_fr: création de tables de hachage

source: definitions of symbols
fr_fr: définitions de symboles

source: directory-oriented functions
fr_fr: directory-oriented fonctions

source: false
fr_fr: faux

source: field width
fr_fr: Largeur du champ

source: fill-context-prefix from to
fr_fr: fill-context-prefix de à

source: fonts in this manual
fr_fr: polices dans ce manuel

source: for recording miscellaneous information.
fr_fr: pour l'enregistrement d'informations diverses.

source: format specification
fr_fr: La spécification du format

source: formatting strings
fr_fr: Formatage des chaînes de caractères

source: function
fr_fr: fonction

source: function cell
fr_fr: cellule de fonction

source: function, @code{foo}.
fr_fr: fonction, @code{foo}.

source: get symbol property
fr_fr: get symbole propriété

source: hash code
fr_fr: valeur de hachage

source: hash tables
fr_fr: Tables de hachages

source: integer to decimal
fr_fr: D'entier à décimal

source: integer to hexadecimal
fr_fr: D'entier à hexadécimal

source: integer to octal
fr_fr: D'entier à octal

source: integer to string
fr_fr: D'entier à chaîne

source: integers
fr_fr: entiers

source: is a fundamental mathematical constant also called the base of natural logarithms.
fr_fr: est une constante mathématique fondamentale également appelée base des logarithmes naturels.

source: is entirely equivalent to
fr_fr: est rigoureusement équivalent à :

source: is used. If @var{arg} is negative, it signals a @code{domain-error} error.
fr_fr: est employée. Si @var{arg} est négatif, il signale une erreur @code{domain-error}.

source: lexical comparison
fr_fr: Comparaison lexicale

source: lispref/abbrevs.texi:104 This function defines @var{tabname} (a symbol) as an abbrev table name, i.e., as a variable whose value is an abbrev table. It defines abbrevs in the table according to @var{definitions}, a list of elements of the form @code{(@var{abbrevname} @var{expansion} @var{hook} @var{usecount} @var{system-flag})}. If an element of @var{definitions} has length less than five, omitted elements default to @code{nil}. A value of @code{nil} for @var{usecount} is equivalent to zero. The return value is always @code{nil}.
fr_fr: Cette fonction définit @var{tabname} (un symbole) comme le nom d'une table d'abréviations, c.-à-d., comme variable dont la valeur est une table d'abréviations. Elle définit les abréviations dans la table selon @var{definitions}, une liste d'éléments de forme @code{(@var{abbrevname} @var{expansion} @var{hook} @var{usecount} @var{system-flag})}. Si un élément de @var{definitions} a la longueur inférieure à cinq, les éléments omis par défaut sont @code{nil}. Une valeur de @code{nil} pour @var{usecount} est équivalente à zéro. La valeur de retour est toujours @code{nil}.

source: lispref/abbrevs.texi:110 If this function is called more than once for the same @var{tabname}, subsequent calls add the definitions in @var{definitions} to @var{tabname}, rather than overriding the entire original contents. (A subsequent call only overrides abbrevs explicitly redefined or undefined in @var{definitions}.)
fr_fr: Si cette fonction est appelée plus d'une fois pour le même @var{tabname}, les appels suivants ajoutent les définitions dans @var{definitions} à @var{tabname}, plutôt que de modifier en entier le contenu original. (Un appel suivant modifie seulement des abréviations explicitement redéfinies ou éliminées dans @var{definitions}.)

source: lispref/abbrevs.texi:115 This is a list of symbols whose values are abbrev tables. @code{define-abbrev-table} adds the new abbrev table name to this list.
fr_fr: C'est une liste de symboles dont les valeurs sont des tables d'abréviations. @code{define-abbrev-table} ajoute le nouveau nom de table d'abréviations à cette liste.

source: lispref/abbrevs.texi:121 This function inserts before point a description of the abbrev table named @var{name}. The argument @var{name} is a symbol whose value is an abbrev table. The return value is always @code{nil}.
fr_fr: Cette fonction insère avant le point une description de la table d'abréviations avant nommé @var{name}. L'argument @var{name} est un symbole dont la valeur est la table d'abréviations. La valeur de retour est toujours @code{nil}.

source: lispref/abbrevs.texi:128 If @var{human} is non-@code{nil}, the description is human-oriented. System abbrevs are listed and identified as such. Otherwise the description is a Lisp expression---a call to @code{define-abbrev-table} that would define @var{name} as it is currently defined, but without the system abbrevs. (The mode or package using @var{name} is supposed to add these to @var{name} separately.)
fr_fr: Si @var{human} est non-@code{nil}, la description est orientée pour l'humain. Des abréviations de système sont énumérées et identifiées en tant que telles. Autrement la description est une expression de Lisp---un appel à @code{define-abbrev-table} définirait @var{name} comme il l'est actuellement, mais en dehors des abréviations de système---. (Le mode ou le paquet employant @var{name} est supposé ajouter ces derniers à @var{name} séparément.)

source: lispref/abbrevs.texi:140 @code{define-abbrev} is the low-level basic function for defining an abbrev in a specified abbrev table. When major modes predefine standard abbrevs, they should call @code{define-abbrev} and specify @code{t} for @var{system-flag}. Be aware that any saved non-``system'' abbrevs are restored at startup, i.e. before some major modes are loaded. Major modes should therefore not assume that when they are first loaded their abbrev tables are empty.
fr_fr: @code{define-abbrev} est la fonction de base de bas niveau pour définir les abréviations dans une table d'abréviations indiquée. Si les modes majeurs prédéfinissent la norme des abréviations, ils devraient appeler @code{define-abbrev} et indiquer @code{t} pour @var{system-flag}. Faites attention, les abréviations non sauvés du non-``système'' sont restaurées au démarrage, c.-à-d. avant que les modes majeurs sont chargés. C'est pourquoi les modes majeurs ne devraient pas assumer que, quand ils sont d'abord chargés, leurs tables d'abbréviations soient vides.

source: lispref/abbrevs.texi:145 This function defines an abbrev named @var{name}, in @var{table}, to expand to @var{expansion} and call @var{hook}. The return value is @var{name}.
fr_fr: Cette fonction définit une abréviation appelée @var{name}, dans @var{table}, à développer @var{expansion} et appeler @var{hook}. La valeur de retour est @var{name}.

source: lispref/abbrevs.texi:149 The value of @var{count}, if specified, initializes the abbrev's usage-count. If @var{count} is not specified or @code{nil}, the use count is initialized to zero.
fr_fr: La valeur @var{count}, si indiquée, initialise les abréviations usage-compter. Si @var{count} n'est pas indiqué ou est @code{nil}, l'usage du compteur est initialisée à zéro.

source: lispref/abbrevs.texi:16 An abbreviation or @dfn{abbrev} is a string of characters that may be expanded to a longer string. The user can insert the abbrev string and find it replaced automatically with the expansion of the abbrev. This saves typing.
fr_fr: Une abréviation ou @dfn{abbrev} est une chaîne de caractères qui peut être développée dans une chaîne plus longue. L'utilisateur peut insérer la chaîne d'abréviation et se rendre compte qu'elle a été remplacée automatiquement avec l'expansion de l'abréviation. Ceci améliore la dactylographie.

source: lispref/abbrevs.texi:21 The set of abbrevs currently in effect is recorded in an @dfn{abbrev table}. Each buffer has a local abbrev table, but normally all buffers in the same major mode share one abbrev table. There is also a global abbrev table. Normally both are used.
fr_fr: Actuellement, l'ensemble des abréviations est enregistré dans un @dfn{abbrev table}. Chaque tampon a une table locale d'abréviations, mais normalement tous les tampons dans le même mode majeur partage une table principale d'abréviations. Il y a donc une table d'abréviation global. Normalement tous les deux sont employés.

source: lispref/abbrevs.texi:33 An abbrev table is represented as an obarray containing a symbol for each abbreviation. The symbol's name is the abbreviation; its value is the expansion; its function definition is the hook function to do the expansion (@pxref{Defining Abbrevs}); its property list cell typically contains the use count, the number of times the abbreviation has been expanded. Alternatively, the use count is on the @code{count} property and the system-abbrev flag is on the @code{system-type} property. Abbrevs with a non-@code{nil} @code{system-type} property are called ``system'' abbrevs. They are usually defined by modes or packages, instead of by the user, and are treated specially in certain respects.
fr_fr: Une table d'abréviation est représentée en tant qu'une liste contenant un symbole pour chaque abréviation. Le nom du symbole est l'abréviation ; sa valeur est l'expansion ; sa définition de fonction est la fonction hook devant faire l'expansion (@pxref{Defining Abbrevs}) ; sa cellule de liste de propriété contient typiquement le compteur d'utilisation, le nombre de fois que l'abréviation a été développée. Alternativement, le compteur d'utilisation pointe vers la propriété @code{count} et le drapeau de system-abbrev pointe vers la propriété @code{system-type}. Les abréviations avec la propriété non-@code{nil} @code{system-type} s'appellent les abréviations de ``système''. Elles sont habituellement définies par des modes ou des paquets, non par l'utilisateur, et traitées spécialement à certains égards.

source: lispref/abbrevs.texi:39 Because the symbols used for abbrevs are not interned in the usual obarray, they will never appear as the result of reading a Lisp expression; in fact, normally they are never used except by the code that handles abbrevs. Therefore, it is safe to use them in an extremely nonstandard way. @xref{Creating Symbols}.
fr_fr: Puisque les symboles utilisés pour les abréviations ne sont pas compris dans la liste habituel, ils n'apparaîtront jamais comme le résultat de lecture d'une expression Lisp ; en fait, normalement ils ne sont jamais utilisés excepté par le code qui traite ces abréviations. Par conséquent, il est prudent de les utiliser d'une manière extrêmement non-standard. @xref{Création de symboles}.

source: lispref/abbrevs.texi:42 For the user-level commands for abbrevs, see @ref{Abbrevs,, Abbrev Mode, emacs, The GNU Emacs Manual}.
fr_fr: Pour les commandes du niveau utilisateur des abréviations, voir @ref{Abbrevs,, Abbrev Mode, emacs, The GNU Emacs Manual}.

source: lispref/abbrevs.texi:58 Abbrev mode is a minor mode controlled by the value of the variable @code{abbrev-mode}.
fr_fr: Le mode abbrev est un mode mineur contrôlé par la valeur de la variable @code{abbrev-mode}.

source: lispref/abbrevs.texi:64 A non-@code{nil} value of this variable turns on the automatic expansion of abbrevs when their abbreviations are inserted into a buffer. If the value is @code{nil}, abbrevs may be defined, but they are not expanded automatically.
fr_fr: Une valeur non-@code{nil} de cette variable active l'expansion automatique des abréviations quand elles sont insérées dans un tampon. Si la valeur est @code{nil}, des abréviations peuvent être définis, mais elles ne sont pas développées automatiquement.

source: lispref/abbrevs.texi:66 This variable automatically becomes buffer-local when set in any fashion.
fr_fr: Cette variable devient automatiquement locale au tampon quand elle est activée dans n'importe quelle mode.

source: lispref/abbrevs.texi:71 This is the value of @code{abbrev-mode} for buffers that do not override it. This is the same as @code{(default-value 'abbrev-mode)}.
fr_fr: C'est la valeur de @code{abbrev-mode} pour les tampons qui ne la modifient pas. C'est identique à @code{(default-value 'abbrev-mode)}.

source: lispref/abbrevs.texi:81 This function creates and returns a new, empty abbrev table---an obarray containing no symbols. It is a vector filled with zeros.
fr_fr: Cette fonction crée et renvoie une nouvelle table vide d'abréviations---une liste ne contient aucun symbole---. C'est un vecteur rempli de zéros.

source: lispref/abbrevs.texi:86 This function undefines all the abbrevs in abbrev table @var{table}, leaving it empty. It always returns @code{nil}.
fr_fr: Cette fonction élimine toutes les abréviations dans la table d'abrévations @var{table}, la laissant vide. Elle renvoie toujours @code{nil}.

source: lispref/abbrevs.texi:93 This function returns a copy of abbrev table @var{table}---a new abbrev table that contains the same abbrev definitions. The only difference between @var{table} and the returned copy is that this function sets the property lists of all copied abbrevs to 0.
fr_fr: Cette fonction renvoie une copie de table d'abréviations @var{table}---une nouvelle table d'abréviations qui contient les mêmes définitions d'abréviations---. La seule différence entre @var{table} et la copie retournée est que la fonction place les listes de propriétés de toutes les abréviations copiées à 0.

source: lispref/back.texi:23 lispref/intro.texi:18 Most of the GNU Emacs text editor is written in the programming language called Emacs Lisp. You can write new code in Emacs Lisp and install it as an extension to the editor. However, Emacs Lisp is more than a mere ``extension language''; it is a full computer programming language in its own right. You can use it as you would any other programming language.
fr_fr: La majeure partie de l'éditeur de texte GNU Emacs est écrite dans le langage de programmation appelé Emacs Lisp. Vous pouvez écrire le nouveau code en Emacs Lisp et l'installer comme extension de l'éditeur. Cependant, Emacs Lisp est plus qu'un simple ``langage d'extension'' ; c'est un langage de programmation complet et autonome d'ordinateur. Vous pouvez l'employer comme n'importe quel autre langage de programmation.
